#include <输入输出.h>

i32 例子2_主函数(i32 参数个数, c8 **参数表) {
	(空) 参数个数;
	(空) 参数表;

	格式化输出("有符号整数类型：\n");
	格式化输出("i8 类型大小 = %d\n", 取字节数(i8));
	格式化输出("i16 类型大小 = %d\n", 取字节数(i16));
	格式化输出("i32 类型大小 = %d\n", 取字节数(i32));
	格式化输出("i64 类型大小 = %d\n", 取字节数(i64));

	格式化输出("无符号整数类型：\n");
	格式化输出("u8 类型大小 = %d\n", 取字节数(u8));
	格式化输出("u16 类型大小 = %d\n", 取字节数(u16));
	格式化输出("u32 类型大小 = %d\n", 取字节数(u32));
	格式化输出("u64 类型大小 = %d\n", 取字节数(u64));

	格式化输出("浮点数类型：\n");
	格式化输出("f32 类型大小 = %d\n", 取字节数(f32));
	格式化输出("f64 类型大小 = %d\n", 取字节数(f64));
	格式化输出("f128 类型大小 = %d\n", 取字节数(f128));

	返回 0;
}
