#pragma once

#include "../../汉化/汉化.h"

#include <math.h>

#define 数值溢出				HUGE_VAL

//f64 反余弦(f64 x);
//
//f64 反正弦(f64 x);
//
//f64 反正切(f64 x);
//
//f64 反正切2(f64 x, f64 y);
//
//f64 余弦(f64 x);
//
//f64 双曲余弦(f64 x);
//
//f64 正弦(f64 x);
//
//f64 双曲正弦(f64 x);
//
//f64 双曲正切(f64 x);
//
//f64 幂(f64 x);
//
//f64 幂2(f64 x, i32 *指数);
//
//f64 幂3(f64 x, i32 指数);
//
//f64 自然对数(f64 x);
//
//f64 基数十对数(f64 x);
//
//f64 浮点数分离(f64 x, f64 *整数部分);
//
//f64 幂4(f64 x, f64 y);
//
//f64 平方根(f64 x);
//
//f64 上近整数(f64 x);
//
//f64 绝对值(f64 x);
//
//f64 下近整数(f64 x);
//
//f64 余数(f64 x, f64 y);
//
