#include "../头文件/数学.h"


//f64 反余弦(f64 x) {
//	返回 acos(x);
//}
//
//f64 反正弦(f64 x) {
//	返回 asin(x);
//}
//
//f64 反正切(f64 x) {
//	返回 atan(x);
//}
//
//f64 反正切2(f64 x, f64 y) {
//	返回 atan2(x, y);
//}
//
//f64 余弦(f64 x) {
//	返回 cos(x);
//}
//
//f64 双曲余弦(f64 x) {
//	返回 cosh(x);
//}
//
//f64 正弦(f64 x) {
//	返回 sin(x);
//}
//
//f64 双曲正弦(f64 x) {
//	返回 sinh(x);
//}
//
//f64 双曲正切(f64 x) {
//	返回 tanh(x);
//}
//
//f64 幂(f64 x) {
//	返回 exp(x);
//}
//
//f64 幂2(f64 x, i32 *指数) {
//	返回 frexp(x, 指数);
//}
//
//f64 幂3(f64 x, i32 指数) {
//	返回 ldexp(x, 指数);
//}
//
//f64 自然对数(f64 x) {
//	返回 log(x);
//}
//
//f64 基数十对数(f64 x) {
//	返回 log10(x);
//}
//
//f64 浮点数分离(f64 x, f64 *整数部分) {
//	返回 modf(x, 整数部分);
//}
//
//f64 幂4(f64 x, f64 y) {
//	返回 pow(x, y);
//}
//
//f64 平方根(f64 x) {
//	返回 sqrt(x);
//}
//
//f64 上近整数(f64 x) {
//	返回 ceil(x);
//}
//
//f64 绝对值(f64 x) {
//	返回 fabs(x);
//}
//
//f64 下近整数(f64 x) {
//	返回 floor(x);
//}
//
//f64 余数(f64 x, f64 y) {
//	返回 fmod(x, y);
//}
